---
kind: type
id: T:Autodesk.Revit.DB.IExtension
source: html/02355f63-69e9-ae86-31bf-c42c18beef46.htm
---
# Autodesk.Revit.DB.IExtension

An interface that supports the additional operation for Extension Status

## Syntax (C#)
```csharp
public interface IExtension
```

## Remarks
See Also IExtension Members Autodesk.Revit.DB Namespace